cavity/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs (sampling);

setFormat raw;

interpolationScheme cellPoint;

fields (p U);

sets
(
    internalCloud
    {
        type        cloud;
        axis        xyz;
        points      
        (
            (0.000390625 0.000390625 0.0005)
            (0.0011718750000000002 0.000390625 0.0005)
            (0.001953125 0.000390625 0.0005)
            (0.0027343750000000003 0.000390625 0.0005)
            (0.003515625 0.000390625 0.0005)
            (0.004296875 0.000390625 0.0005)
            (0.005078125 0.000390625 0.0005)
            (0.005859375 0.000390625 0.0005)
            (0.006640625000000001 0.000390625 0.0005)
            (0.0074218750000000005 0.000390625 0.0005)
            (0.008203125 0.000390625 0.0005)
            (0.008984375000000001 0.000390625 0.0005)
            (0.009765625 0.000390625 0.0005)
            (0.010546875 0.000390625 0.0005)
            (0.011328125000000001 0.000390625 0.0005)
            (0.012109375 0.000390625 0.0005)
            (0.012890625000000001 0.000390625 0.0005)
            (0.013671875 0.000390625 0.0005)
            (0.014453125 0.000390625 0.0005)
            (0.015234375000000001 0.000390625 0.0005)
            (0.016015625000000002 0.000390625 0.0005)
            (0.016796875 0.000390625 0.0005)
            (0.017578125 0.000390625 0.0005)
            (0.018359375 0.000390625 0.0005)
            (0.019140625 0.000390625 0.0005)
            (0.019921875000000002 0.000390625 0.0005)
            (0.020703125000000003 0.000390625 0.0005)
            (0.021484375 0.000390625 0.0005)
            (0.022265625 0.000390625 0.0005)
            (0.023046875 0.000390625 0.0005)
            (0.023828125000000002 0.000390625 0.0005)
            (0.024609375000000003 0.000390625 0.0005)
            (0.025390625 0.000390625 0.0005)
            (0.026171875 0.000390625 0.0005)
            (0.026953125 0.000390625 0.0005)
            (0.027734375000000002 0.000390625 0.0005)
            (0.028515625000000003 0.000390625 0.0005)
            (0.029296875 0.000390625 0.0005)
            (0.030078125 0.000390625 0.0005)
            (0.030859375 0.000390625 0.0005)
            (0.031640625 0.000390625 0.0005)
            (0.032421875 0.000390625 0.0005)
            (0.033203125 0.000390625 0.0005)
            (0.033984375000000004 0.000390625 0.0005)
            (0.034765625 0.000390625 0.0005)
            (0.035546875 0.000390625 0.0005)
            (0.036328125 0.000390625 0.0005)
            (0.037109375 0.000390625 0.0005)
            (0.037890625000000004 0.000390625 0.0005)
            (0.038671875 0.000390625 0.0005)
            (0.039453125000000006 0.000390625 0.0005)
            (0.040234375 0.000390625 0.0005)
            (0.041015625 0.000390625 0.0005)
            (0.041796875000000004 0.000390625 0.0005)
            (0.042578125 0.000390625 0.0005)
            (0.043359375000000006 0.000390625 0.0005)
            (0.044140625 0.000390625 0.0005)
            (0.044921875 0.000390625 0.0005)
            (0.045703125000000004 0.000390625 0.0005)
            (0.046484375 0.000390625 0.0005)
            (0.047265625000000006 0.000390625 0.0005)
            (0.048046875 0.000390625 0.0005)
            (0.048828125 0.000390625 0.0005)
            (0.049609375000000004 0.000390625 0.0005)
            (0.050390625 0.000390625 0.0005)
            (0.051171875000000006 0.000390625 0.0005)
            (0.051953125 0.000390625 0.0005)
            (0.052734375 0.000390625 0.0005)
            (0.053515625000000004 0.000390625 0.0005)
            (0.054296875 0.000390625 0.0005)
            (0.055078125000000006 0.000390625 0.0005)
            (0.055859375 0.000390625 0.0005)
            (0.056640625 0.000390625 0.0005)
            (0.057421875000000004 0.000390625 0.0005)
            (0.058203125 0.000390625 0.0005)
            (0.058984375000000006 0.000390625 0.0005)
            (0.059765625 0.000390625 0.0005)
            (0.060546875 0.000390625 0.0005)
            (0.061328125000000004 0.000390625 0.0005)
            (0.062109375 0.000390625 0.0005)
            (0.062890625 0.000390625 0.0005)
            (0.063671875 0.000390625 0.0005)
            (0.064453125 0.000390625 0.0005)
            (0.065234375 0.000390625 0.0005)
            (0.06601562500000001 0.000390625 0.0005)
            (0.066796875 0.000390625 0.0005)
            (0.067578125 0.000390625 0.0005)
            (0.068359375 0.000390625 0.0005)
            (0.069140625 0.000390625 0.0005)
            (0.06992187500000001 0.000390625 0.0005)
            (0.070703125 0.000390625 0.0005)
            (0.071484375 0.000390625 0.0005)
            (0.072265625 0.000390625 0.0005)
            (0.073046875 0.000390625 0.0005)
            (0.07382812500000001 0.000390625 0.0005)
            (0.074609375 0.000390625 0.0005)
            (0.075390625 0.000390625 0.0005)
            (0.076171875 0.000390625 0.0005)
            (0.07695312500000001 0.000390625 0.0005)
...
        );
    }
);

// ************************************************************************* //
